MS-28k-r-r-lvm.log
MS-28k-r-r: (g=0): rw=randread, bs=(R) 28.0KiB-28.0KiB, (W) 28.0KiB-28.0KiB, (T) 28.0KiB-28.0KiB, ioengine=libaio, iodepth=32
...
fio-3.25-15-gced2
Starting 16 processes
MS-28k-r-r: Laying out IO file (1 file / 102400MiB)
28k-r-r: Laying out IO file (1 file / 102400MiB)
28k-r-r: Laying out IO file (1 file / 102400MiB)
28k-r-r: Laying out IO file (1 file / 102400MiB)
[...]

MS-28k-r-r: (groupid=0, jobs=16): err= 0: pid=157582: Thu Dec 24 11:34:58 2020
  read: IOPS=27.7k, BW=758MiB/s (795MB/s)(44.4GiB/60045msec)
    slat (usec): min=2, max=269, avg=14.93, stdev= 4.97
    clat (usec): min=91, max=121872, avg=18385.71, stdev=20867.07
     lat (usec): min=112, max=121879, avg=18401.15, stdev=20866.93
    clat percentiles (usec):
     |  1.00th=[   338],  5.00th=[   562], 10.00th=[   906], 20.00th=[  2180],
     | 30.00th=[  4490], 40.00th=[  6980], 50.00th=[  9241], 60.00th=[ 11994],
     | 70.00th=[ 17957], 80.00th=[ 43254], 90.00th=[ 53740], 95.00th=[ 58983],
     | 99.00th=[ 78119], 99.50th=[ 85459], 99.90th=[ 95945], 99.95th=[ 99091],
     | 99.99th=[105382]
   bw (  KiB/s): min= 4322, max=4012656, per=20.96%, avg=162605.54, stdev=18054.47, samples=1663928
   iops        : min=   16, max=   16, avg=16.00, stdev= 0.00, samples=1663928
  lat (usec)   : 100=0.01%, 250=0.31%, 500=3.36%, 750=4.53%, 1000=2.79%
  lat (msec)   : 2=8.02%, 4=9.03%, 10=24.80%, 20=18.83%, 50=14.43%
  lat (msec)   : 100=13.88%, 250=0.04%
  cpu          : usr=1.29%, sys=3.65%, ctx=1610368, majf=0, minf=69584
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=1663928,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=758MiB/s (795MB/s), 758MiB/s-758MiB/s (795MB/s-795MB/s), io=44.4GiB (47.7GB), run=60045-60045msec

Disk stats (read/write):
    dm-2: ios=1663928/25, merge=0/0, ticks=30571429/9, in_queue=30660705, util=99.35%, aggrios=207991/2, aggrmerge=0/0, aggrticks=3821741/1, aggrin_queue=3833612, aggrutil=99.24%
  nvme0n1: ios=1663928/6, merge=0/1, ticks=30573933/8, in_queue=30668900, util=99.24%
  nvme1n1: ios=0/5, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme3n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme4n1: ios=0/2, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme5n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme6n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme7n1: ios=0/10, merge=0/1, ticks=0/0, in_queue=0, util=0.00%